In [6]:
import numpy as np
import pandas as pd

In [7]:
path = './data/'
df_train = pd.read_csv(path+'titanic_train.csv')
df_test = pd.read_csv(path + 'titanic_test.csv')

In [8]:
df_train = df_train.drop(['PassengerId','Survived'] , axis = 1)
df_test = df_test.drop(['PassengerId'], axis = 1)
df = pd.concat([df_train,df_test])
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
dtype_df = df.dtypes.reset_index()
dtype_df.columns = ['count','column type']
print(dtype_df)
dtype_df = dtype_df.groupby('column type').aggregate('count').reset_index()
dtype_df

      count column type
0    Pclass       int64
1      Name      object
2       Sex      object
3       Age     float64
4     SibSp       int64
5     Parch       int64
6    Ticket      object
7      Fare     float64
8     Cabin      object
9  Embarked      object

  column type  count
0       int64      3
1     float64      2
2      object      5

In [28]:
int_features = []
float_features = []
object_features = []
for dtype, feature in zip(df.dtypes , df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    if dtype == 'int64':
        int_features.append(feature)
    if dtype == 'object':
        object_features.append(feature)
print(int_features)
print(float_features)
print(object_features)

['Pclass', 'SibSp', 'Parch']
['Age', 'Fare']
['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [29]:
df[int_features].nunique() # 行或列有多少不同值

Pclass    3
SibSp     7
Parch     8
dtype: int64